conf/src/Catalogs/ЭП_Номенклатура/ЭП_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Номенклатура</name>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Catalogs/ЭП_Номенклатура/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ДополнительныеПараметры;	
	Если Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = РегистрыНакопления.ЭП_ОстаткиНаСкладе.ПолучитьДанныеВыбораИнвентарныйНомер(ДополнительныеПараметры.Склад, 
		ДополнительныеПараметры.Номенклатура, 
		ДополнительныеПараметры.ИнвентарныйНомер,
		ДополнительныеПараметры.РежимРаботы,
		ДополнительныеПараметры.Сотрудник,
		ДополнительныеПараметры.ВидНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры
